{"pages":[{"title":"About me","text":"Hi, my name is Cheng Gong. I am looking forward to transit my role from development project manager to software engineer. I developed strong interest in the field of software development and computer science when I was working at a mobile game development studio as a project manager since 2015. With the goal in my mind, I have been learning relavant knowledges by myself and I will continue to learn and practice more. I will be sharing my learnings in this blog site. :) A little bit more about my previous experience:At the time I joined the game studio, I was in charge of all the localization projects and helped the studio to establish a productive inter-departmental communication protocol. In 2016, I became a game development project manager as the company shifted strategy from game publishing to game development. In my new role, I have adopted Agile development methodology for the development team, and utilized issue tracking and collaboration tools such as JIRA and Confluence. My responsibilities included managing two Agile development teams at the same time, facilitating and continually improving development process, making data-driven decisions, defining content roadmaps, and ensuring cross-functional communication smoothly. Under my management, the team shipped a globally successful game, a MMORPG, in 2017 on several platforms including App Store, Google Play, Stream, and Facebook Gameroom. In order to enhance my professional skills, I took various online courses in my spare time such as engineering project management, Python programming, and game design. The self-paced online learning experience enables me to manage time wisely, and also proved my self-learning skill.","link":"/about/index.html"}],"posts":[{"title":"About me","text":"Hi, my name is Cheng Gong. I am looking forward to transit my role from development project manager to software engineer. I developed strong interest in the field of software development and computer science when I was working at a mobile game development studio as a project manager since 2015. With the goal in my mind, I have been learning relavant knowledges by myself and I will continue to learn and practice more. I will be sharing my learnings in this blog site. :) A little bit more about my previous experience:At the time I joined the game studio, I was in charge of all the localization projects and helped the studio to establish a productive inter-departmental communication protocol. In 2016, I became a game development project manager as the company shifted strategy from game publishing to game development. In my new role, I have adopted Agile development methodology for the development team, and utilized issue tracking and collaboration tools such as JIRA and Confluence. My responsibilities included managing two Agile development teams at the same time, facilitating and continually improving development process, making data-driven decisions, defining content roadmaps, and ensuring cross-functional communication smoothly. Under my management, the team shipped a globally successful game, a MMORPG, in 2017 on several platforms including App Store, Google Play, Stream, and Facebook Gameroom. In order to enhance my professional skills, I took various online courses in my spare time such as engineering project management, Python programming, and game design. The self-paced online learning experience enables me to manage time wisely, and also proved my self-learning skill.","link":"/2019/03/18/About-me/"},{"title":"Pygame project","text":"I recently made a mini shooting game with Python and Pygame by following a Pygame programming tutorial. It is absolutely fun to play a game that is written by myself. Within this mini project, I used the basic data structures and control flows in Python. I also practiced objective oriented programming and had a better understanding on how effecient and important OOP is. While writing the code, I like keeping all the notes for each session of the code, so that the final code could be easier to understand by newbie like myself. I also added some little features in addition to the original gameplay of the tutorial project, such as winning condition. You can find the full project from my GitHub page: https://github.com/airbaggie/shooting-game. If you would like to play it, you need to have Python and Pygame installed locally.:) Gameplay The guy without HP bar is player character which you will be controlling with. The goblin with HP bar is enemy character who has 100 points of HP in total. The green color of the HP bar indicates the remaining HP of the goblin. Each bullet cause 10 points of damage. Your total score displays on the top right. You gain 10 points when a bullet has hit the goblin. You lose 5 points if your character collide with the goblin. Control LEFT key: move left RIGHT key: move right UP key: jump SPACE key: shoot bullet Resource Pygame programing tutorial: https://www.youtube.com/playlist?list=PLzMcBGfZo4-lp3jAExUCewBfMx3UZFkh5 Pygame documentation: https://www.pygame.org/docs/ Assets: Free online assets","link":"/2019/03/20/Pygame-project/"},{"title":"Seekr","text":"I finished a full stack project, “Seekr”. It is an web app that allows users to search for software engineering related jobs, review open positions on the map, and manage their interview process on a JIRA-like tracking board. This project has a decoupled backend and frontend. I have a Postgres database and I’m using Flask to serve a RESTful API. All that data is being consumed and displayed with React. Before starting the project I knew that I could use Flask to serve JSON. However, my backend and frontend exchange data frequently, so I did some research and decided to use Flask RESTful API in addition to Flask. This helped me quickly setting up all the endpoints for CRUD actions. The job information comes from indeed.com and the Google Places API. Since indeed doesn’t provide public API, I scraped the data from their website with Beatiful Soup and Selenium. The Google Places API is being used to collect companies’ geolocation info and the rating scores. All these get stored in Postgres. My frontend is built with React. It uses fetch function to make AJAX requests to my backend API. One thing I want to mention is, I first built my MVP using jQuery and Jinja, and I then refactored all of those using React and JSX. I did this because I want to practice building frontend in different ways. Once a login user saved a job and marked it as an applied one, it appears on a JIRA-like tracking board which is my favorite feature. As a former project manager, I used Jira a lot. I like its interactivity, which motivated me to implement this feature. To do this, I used a library called React-DnD, to make my card component draggable and my column component droppable. I used callback function to listen to the dropping event, so anytime a card has been moved, it immediately updates the status and creates a system log in database. There are also modals for user to write notes, or to manually create job card to track. From this project, I have gained experience of modeling a relational database, creating a backend API and building a frontend using React. Now the web is live at http://seekr.link. Notice that I’m not going to scrape more data from indeed, which means the searching results will be out of date. However, I encourage you to sign up and check out the tracking feature. You can defenitly use it to manage your actual interview process by using the “add job” feature.:) GitHub pages: Seekr: https://github.com/airbaggie/seekr_web_app Web scraper: https://github.com/airbaggie/web_scraper","link":"/2019/06/22/Seekr/"},{"title":"My first post","text":"Welcome to my blog! :)","link":"/2019/03/18/My-first-post/"}],"tags":[{"name":"web development","slug":"web-development","link":"/tags/web-development/"}],"categories":[{"name":"python","slug":"python","link":"/categories/python/"},{"name":"web development","slug":"web-development","link":"/categories/web-development/"}]}